messages = {
    'ru': {
        'welcome': "Привет, {user_name}! 🎉\n\n"
                   "Здесь ты можешь создать уникальную сказку для своего ребёнка на любую тему  ! 📖✨\n"
                   "Выбери тему и погружайся в волшебный мир приключений! 🌟",
        'about_message': '''Привет! Я — бот, который помогает создавать сказки для детей. 🎉
Вы можете выбрать тему и создать уникальную сказку на любую тему! 📖
Если вам нужна помощь, всегда можно обратиться за поддержкой. ✨

Наслаждайтесь волшебством! 🌟

👨‍💻 Разработчик: @duishobaevislam01
💻 Для вопросов и предложений нажмите кнопку "💬 Отправить отзыв".''',
        'help_message': '''💡 Привет! Я — бот, который помогает создавать сказки для детей. Вот что ты можешь сделать:

1️⃣ **📖 Создать сказку** – выбери тему и создай уникальную сказку для детей! 📖
2️⃣ **🌟 Топ сказок** – ознакомься с лучшими сказками, созданными другими пользователями! 🌟
3️⃣ **❓ Помощь** – если у тебя возникнут вопросы, я всегда готов помочь! 💬
4️⃣ **💬 Отправить отзыв** – хочешь поделиться своим мнением или предложением? Нажми на кнопку "💬 Отправить отзыв". 💌
5️⃣ **ℹ️ О боте** – узнай больше обо мне и моих возможностях.
6️⃣ **🌐 Сменить язык** – выбери удобный для тебя язык общения.

Просто нажми на соответствующую кнопку и выбери действие! ✨

Помни, я всегда здесь, чтобы помочь! 😊''',
        'review': "Пожалуйста, оставьте свой отзыв о работе бота. 💬\nВы можете написать любые предложения или замечания.",
        'request_canceled': "Отправка отзыва отменена. 🔙 Возвращаемся в главное меню.",
        'review_thanks': "Спасибо за ваш отзыв! Мы ценим ваше мнение. 🙏",
        'review_invalid': "Ваш отзыв пустой. Пожалуйста, введите текст или отмените отправку.",
        "ask_theme": "✨ Пожалуйста, введите тему для вашей сказки! 📖💫",
        "story_canceled": "Создание сказки отменено. 😌",
        "listen": "🎧 Слушать",
        "return_menu": "🔙 Вернуться в меню",
        "request_canceled_story": "Запрос был отменен. Пожалуйста, введите тему заново.",
        "top_story": "Вот интересные сказки топ-3:"
    },
    'en': {
        'welcome': "Hello, {user_name}! 🎉\n\n"
                   "Here, you can create a unique fairy tale for your child on any topic! 📖✨\n"
                   "Choose a theme and dive into a magical world of adventure! 🌟",
        'about_message': '''Hello! I am a bot that helps you create fairy tales for kids. 🎉
You can choose a topic and create a unique fairy tale on any theme! 📖
If you need help, you can always contact support. ✨

Enjoy the magic! 🌟

👨‍💻 Developer: @duishobaevislam01
💻 For questions and suggestions, click the "Send Feedback" button.''',
        'help_message': '''💡 Hello! I'm a bot that helps you create fairy tales for children. Here's what you can do:

1️⃣ **📖 Create Story** – Choose a theme and create a unique story for kids! 📖
2️⃣ **🌟 Top Stories** – Check out the top stories created by other users! 🌟
3️⃣ **❓ Help** – If you have any questions, I’m here to assist! 💬
4️⃣ **💬 Send Feedback** – Want to share your thoughts or suggestions? Just click the "💬 Send Feedback" button. 💌
5️⃣ **ℹ️ About** – Learn more about me and what I can do.
6️⃣ **🌐 Change Language** – Select the language that suits you best.

Just press the button of your choice and get started! ✨

Remember, I’m always here to help! 😊''',
        'review': "Please leave your feedback about the bot. 💬\nYou can write any suggestions or remarks.",
        'request_canceled': "Feedback submission canceled. 🔙 Returning to the main menu.",
        'review_thanks': "Thank you for your feedback! We appreciate your input. 🙏",
        'review_invalid': "Your feedback is empty. Please enter text or cancel the submission.",
        "ask_theme": "✨ Please enter the theme for your story! 📖💫",
        "story_canceled": "Story creation has been canceled. 😌",
        "listen": "🎧 Listen",
        "return_menu": "🔙 Return to menu",
        "request_canceled_story": "The request was canceled. Please enter the theme again.",
        "top_story": "Here are the top 3 interesting tales:"

    },
    'kgz': {
        'welcome': "Салам, {user_name}! 🎉\n\n"
                   "Бул жерде сиз балаңыз үчүн каалаган темада өзгөчө жомок жарата аласыз! 📖✨\n"
                   "Теманы тандап, укмуштуу окуялар дүйнөсүнө сүңгүңүз! 🌟",
        'about_message': '''Салам! Мен балдар үчүн жомокторду түзүүгө жардам берген ботмун. 🎉
Сиз тема тандап, каалаган темада уникалдуу жомок түзө аласыз! 📖
Эгер жардам керек болсо, ар дайым колдоо көрсөтүүгө кайрылсаңыз болот. ✨

Сказканы түшүнүңүз! 🌟

👨‍💻 Жасаган: @duishobaevislam01
💻 Сураныч жана сунуштар үчүн "💬 Пикир жазуу" баскычын басыңыз.''',
        'help_message': '''💡 Салам! Мен — балдар үчүн жомок түзүүгө жардам берген ботмун. Бул жерде сиз эмнелерди кыла аласыз:

1️⃣ **📖 Жомок түзүү** – Теманы тандап, балдар үчүн уникалдуу жомок жаратсаңыз болот! 📖
2️⃣ **🌟 Жомоктордун топу** – Башка колдонуучулар түзгөн эң мыкты жомокторду көрүңүз! 🌟
3️⃣ **❓ Жардам** – Суроолоруңуз болсо, мен ар дайым жардам берүүгө даярмын! 💬
4️⃣ **💬 Пикир жазуу** – Оюңузду же сунушуңузду бөлүшкүңүз келеби? "💬 Пикир жазуу" баскычын басыңыз. 💌
5️⃣ **ℹ️ Бот жөнүндө** – Мен жана функцияларым жөнүндө көбүрөөк билүү.
6️⃣ **🌐 Тилди өзгөртүү** – Каалаган тилиңизди тандаңыз.

Тиешелүү баскычты басып, керектүү ишти тандаңыз! ✨

Эсиңизде болсун, мен ар дайым жардам берүү үчүн бул жактамын! 😊''',
        'review': "Боттун иши жөнүндө пикириңизди калтырыңыз. 💬\nКандайдыр бир сунуштар же эскертүүлөрдү жаза аласыз.",
        'request_canceled': "Пикир жазуу токтотулду. 🔙 Башкы менюга кайтуудабыз.",
        'review_thanks': "Пикириңиз үчүн рахмат! Биз сиздин оюңузду баалайбыз. 🙏",
        'review_invalid': "Сиздин пикириңиз бош. Сураныч, текст киргизиңиз же жазуудан баш тартыңыз.",
        "ask_theme": "✨ Сураныч, сиздин эртегеңиздин темасын киргизиңиз! 📖💫",
        "story_canceled": "Эртегини түзүү токтотулду. 😌",
        "listen": "🎧 Угуу",
        "return_menu": "🔙 Башкы менюга кайтуу",
        "request_canceled_story": "Сураныч, жоюлду. Жаңы теманы киргизиңиз.",
        "top_story":"Эң кызыктуу жомоктордун топ-3:"
    }
}

button_texts = {
        'ru': {
            'create_story': "📖 Создать сказку",
            'view_top_stories': "🌟 Топ сказок",
            'help': "❓ Помощь",
            'about': "ℹ️ О боте",
            'feedback': "💬 Отправить отзыв",
            'change_language': "🌐 Сменить язык",
            'return_menu': "🔙 Вернуться в главное меню"
        },
        'en': {
            'create_story': "📖 Create Story",
            'view_top_stories': "🌟 Top Stories",
            'help': "❓ Help",
            'about': "ℹ️ About",
            'feedback': "💬 Send Feedback",
            'change_language': "🌐 Change Language",
            'return_menu': "🔙 Return to Main Menu"
        },
        'kgz': {
            'create_story': "📖 Жомок түзүү",
            'view_top_stories': "🌟 Жомоктордун топу",
            'help': "❓ Жардам",
            'about': "ℹ️ Бот жөнүндө",
            'feedback':  "💬 Пикир жазуу",
            'change_language': "🌐 Тилди өзгөртүү",
            'return_menu': "🔙 Башкы менюга кайтуу"
        }
    }


cancel = {
    'ru': "Отмена",
    'en': "Cancel",
    'kgz': "Токтотуу"
}


texts = {
    'choose_method': {
        'ru': "✨ Выберите способ создания истории:",
        'en': "✨ Choose a way to create a story:",
        'kgz': "✨ Окуяны түзүү ыкмасын тандаңыз:"
    },
    'by_text': {
        'ru': "📜 Создать по тексту",
        'en': "📜 Create by text",
        'kgz': "📜 Текст менен түзүү"
    },
    'by_photo': {
        'ru': "📷 Создать по фото",
        'en': "📷 Create by photo",
        'kgz': "📷 Сүрөт менен түзүү"
    }
}